ERP DEV.WMS/src/DataProcessors/ПечатьШтрихкода/ПечатьШтрихкода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьШтрихкода</name>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектов</name>
    <type>
      <types>TypeDescription</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КодируемыеЗначения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстНадписиСлева</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ERP DEV.WMS/src/DataProcessors/ПечатьШтрихкода/ObjectModule.bsl
Функция ПечатьТонкийКлиент(Параметры) Экспорт
	
	ТабличныйДокумент = Неопределено;
	
	Если Параметры.РежимПечати = 1 Тогда
		ТабличныйДокумент = СформироватьПечатнуюФормуДляПринтераА4(ТабличныйДокумент,Параметры);
	ИначеЕсли Параметры.РежимПечати = 2 Тогда //Принтер этикеток		
		ТабличныйДокумент = СформироватьПечатнуюФормуДляПринтераЭтикеток(ТабличныйДокумент,Параметры);		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьТонкийКлиент()

Функция СформироватьПечатнуюФормуДляПринтераЭтикеток(ТабличныйДокумент,Параметры) 
	
	// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
	// Рефакторинг: Заменил вмс_Печать на вмс_Печать
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерСтраницы = "Custom";
	ТабличныйДокумент.ВысотаСтраницы = Параметры.ВысотаЭтикетки;
	ТабличныйДокумент.ШиринаСтраницы = Параметры.ШиринаЭтикетки; 
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	
	Попытка
		
		Для каждого Элемент Из Параметры.КодируемыеЗначения Цикл 
			
			
			Макет = ЭтотОбъект.ПолучитьМакет("Макет");
			Шаблон = Макет.ПолучитьОбласть("ОбластьШтрихкода"); 
			
			вмс_Печать.УстановитьБазовыеПараметрыТабличногоДокумента(Шаблон);
			
			Эталон = ЭтотОбъект.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;  //0.26454
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина",          Окр(Параметры.ШиринаЭтикетки / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Высота",          Окр((Параметры.ВысотаЭтикетки - 2) / КоличествоМиллиметровВПикселе));
			ПараметрыШтрихкода.Вставить("Штрихкод",        Параметры.Префикс + Вычислить("Элемент.Значение." + Параметры.РеквизитКодирования));
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь); 
			ПараметрыШтрихкода.Вставить("Масштабировать", Истина);
			ПараметрыШтрихкода.Вставить("ТипКода",Параметры.ТипКода);
			ПараметрыШтрихкода.Вставить("УбратьЛишнийФон", Истина);
			
			//ТУ Алфимов 01.03.2024++
			//Шаблон.Рисунки.Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
			
			Шаблон.Рисунки.Штрихкод.Картинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
			//ТУ Алфимов 01.03.2024-- 
			Шаблон.Рисунки.Штрихкод.Высота = 1; 
			Шаблон.Рисунки.Штрихкод.Ширина = Параметры.ШиринаЭтикетки;    
			
			Шаблон.Параметры.ПредставлениеКода = Элемент.Значение;
			Если Параметры.Отладка Тогда 
				Шаблон.Параметры.ПредставлениеКода =  "" + Шаблон.Параметры.ПредставлениеКода + " - " + ПараметрыШтрихкода.Штрихкод;
			КонецЕсли;			
			Шаблон.ТекущаяОбласть.Шрифт = Новый Шрифт(Шаблон.ТекущаяОбласть.Шрифт,,Параметры.РазмерШрифта,Истина);   
			
			ОбластьПредставления = Шаблон.Область(1,1,1,Шаблон.ШиринаТаблицы);
			ОбластьПредставления.Объединить(); 
			ОбластьПредставления.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			
			КартинкаШтрихкода = Шаблон.Рисунки.Штрихкод; 
			//Сохраним размеры штрихкода
			ВысотаКартинки = КартинкаШтрихкода.Высота;
			ШиринаКартинки = КартинкаШтрихкода.Ширина;
			ВерхКартинки = КартинкаШтрихкода.Верх; 
			ЛевоКартинки = КартинкаШтрихкода.Лево;
			КартинкаШтрихкода.Расположить(ОбластьПредставления);
			//Сохраним размеры штрихкода	
			НоваяШирина = КартинкаШтрихкода.Ширина; 
			НоваяВысота = Параметры.ВысотаЭтикетки - КартинкаШтрихкода.Высота;		
			Разница = (НоваяШирина - ШиринаКартинки) / 2; 
			ВеличинаСдвигаКартинкиНаТекст = КартинкаШтрихкода.Высота / 5; // рассчитаем место, куда можно задвинуть картинку, потому что текст центрирован, внизу есть место
			КартинкаШтрихкода.Верх = ВерхКартинки - ВеличинаСдвигаКартинкиНаТекст; //задвинем картинку на текст
			КартинкаШтрихкода.Высота = НоваяВысота + (ВеличинаСдвигаКартинкиНаТекст + 4);
			КартинкаШтрихкода.Ширина = ШиринаКартинки;
			КартинкаШтрихкода.Лево = ЛевоКартинки + Разница;	
			КартинкаШтрихкода.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			
			Если ЗначениеЗаполнено(Элемент.ТекстНадписиСлева) Тогда
				КартинкаНадписьСлева = Шаблон.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
				КартинкаНадписьСлева.Шрифт = Новый Шрифт(Шаблон.ТекущаяОбласть.Шрифт, , Параметры.РазмерШрифта, Истина);
				КартинкаНадписьСлева.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				КартинкаНадписьСлева.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
				КартинкаНадписьСлева.Текст = Элемент.ТекстНадписиСлева;
				КартинкаНадписьСлева.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				КартинкаНадписьСлева.Лево = 1;
				КартинкаНадписьСлева.Верх = ВерхКартинки;
				КартинкаНадписьСлева.Ширина = 0.25 * НоваяШирина;
				КартинкаНадписьСлева.Высота = НоваяВысота - 1;
				
				Если КартинкаШтрихкода.Лево < КартинкаНадписьСлева.Лево + КартинкаНадписьСлева.Ширина Тогда
					//налезли на картинку штрихкода, подвинем и ужмем ее
					Сдвиг = КартинкаНадписьСлева.Лево + КартинкаНадписьСлева.Ширина - КартинкаШтрихкода.Лево;
					КартинкаШтрихкода.Ширина = КартинкаШтрихкода.Ширина - Сдвиг;
					КартинкаШтрихкода.Лево = КартинкаШтрихкода.Лево + Сдвиг;
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Шаблон);   
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла; 
		
	Исключение 
		
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;  
	
	вмс_Печать.УстановитьБазовыеПараметрыТабличногоДокумента(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;


КонецФункции // СформироватьПечатнуюФормуДляПринтераЭтикеток()

Функция СформироватьПечатнуюФормуДляПринтераА4(ТабличныйДокумент,Параметры)  
	
	// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
	// Рефакторинг: Заменил вмс_Печать на вмс_Печать	
	
	СчетчикЗначений = 0;
	Ограничитель = Параметры.КодируемыеЗначения.Количество() - 1;
	
	СводныйТабличныйДокумент = Новый ТабличныйДокумент;
	СводныйТабличныйДокумент.АвтоМасштаб = Истина;
	СводныйТабличныйДокумент.ПолеСверху = 0;
	СводныйТабличныйДокумент.ПолеСнизу = 0;
	СводныйТабличныйДокумент.ПолеСлева  = 0;
	СводныйТабличныйДокумент.ПолеСправа = 0;
	СводныйТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	СводныйТабличныйДокумент.РазмерКолонтитулаСнизу  = 0;
	СводныйТабличныйДокумент.РазмерСтраницы = "Custom";
	СводныйТабличныйДокумент.ВысотаСтраницы = 297;
	СводныйТабличныйДокумент.ШиринаСтраницы = 210;
	
	Пока СчетчикЗначений <= Ограничитель Цикл 
		
		Страница = Новый ТабличныйДокумент;
		СчетчикКолонок = 1;
	
		Пока СчетчикКолонок <= Параметры.КоличествоКолонок Цикл
			
			ТабличныйДокументКолонка = Новый ТабличныйДокумент;
			ТабличныйДокументКолонка.РазмерСтраницы = "Custom";
			ТабличныйДокументКолонка.ВысотаСтраницы = Параметры.Размеры.Высота;
			ТабличныйДокументКолонка.ШиринаСтраницы = Параметры.Размеры.Ширина;
			СчетчикСтрок = 1;
			
			Пока СчетчикСтрок <= Параметры.КоличествоСтрок Цикл
				
				Если СчетчикЗначений > Ограничитель Тогда
					Прервать;
				КонецЕсли;
				
				Элемент = Параметры.КодируемыеЗначения[СчетчикЗначений];
				
				Макет = ЭтотОбъект.ПолучитьМакет("Макет");
				Шаблон = Макет.ПолучитьОбласть("ОбластьШтрихкода"); 
				
				Эталон = ЭтотОбъект.ПолучитьМакет("Эталон");
				КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;  //0.26454
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина",          Окр(Параметры.Размеры.Ширина / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Высота",          Окр(Параметры.Размеры.Высота / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Штрихкод",        Параметры.Префикс + Вычислить("Элемент.Значение." + Параметры.РеквизитКодирования));
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь); 
				ПараметрыШтрихкода.Вставить("Масштабировать", Истина);	
				ПараметрыШтрихкода.Вставить("ТипКода",Параметры.ТипКода);
				ПараметрыШтрихкода.Вставить("УбратьЛишнийФон", Истина);
				
				//ТУ_Самойленко 21.06.23 ++
				//Шаблон.ТекущаяОбласть.ШиринаКолонки = Окр(Параметры.Размеры.Ширина / 2.5, 1);
				Шаблон.ТекущаяОбласть.ШиринаКолонки = Параметры.Размеры.Ширина / 2;
				//ТУ_Самойленко 21.06.23 --
				
				//ТУ Алфимов 01.03.2024++
				//Шаблон.Рисунки.Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
				
				Шаблон.Рисунки.Штрихкод.Картинка = вмс_Печать.ИзображениеШтрихкода(ПараметрыШтрихкода);
				//ТУ Алфимов 01.03.2024--  
				
				Шаблон.Рисунки.Штрихкод.Высота = Параметры.Размеры.Высота;
				//ТУ_Самойленко 21.06.23 ++
				Шаблон.Рисунки.Штрихкод.Ширина = Параметры.Размеры.Ширина; 
				//ТУ_Самойленко 21.06.23 --
				ТабличныйДокументКолонка.Вывести(Шаблон);   
				
				ОбластьПредставления = Макет.ПолучитьОбласть("ПредставлениеКода");
				ОбластьПредставления.Параметры.ПредставлениеКода = Элемент.Значение; 
				Если Параметры.Отладка Тогда 
					ОбластьПредставления.Параметры.ПредставлениеКода = "" + ОбластьПредставления.Параметры.ПредставлениеКода + " - " + ПараметрыШтрихкода.Штрихкод;
				КонецЕсли;
				ОбластьПредставления.ТекущаяОбласть.Шрифт = Новый Шрифт(ОбластьПредставления.ТекущаяОбласть.Шрифт,,Параметры.РазмерШрифта,Истина);
				ТабличныйДокументКолонка.Вывести(ОбластьПредставления);
				
				СчетчикЗначений = СчетчикЗначений + 1;
				СчетчикСтрок = СчетчикСтрок + 1;
			КонецЦикла;
			
			Страница.Присоединить(ТабличныйДокументКолонка);
			
			СчетчикКолонок = СчетчикКолонок + 1;
			
		КонецЦикла;
		
		СводныйТабличныйДокумент.Вывести(Страница);
		СводныйТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
		
	Возврат СводныйТабличныйДокумент;
	

КонецФункции // СформироватьПечатнуюФормуДляПринтераА4()

Функция КоэффициентРазмераШрифта()
	//Нужен, чтобы посчитать высоту шрифта в мм. и подогнать картинку	
	Возврат 0.352;
КонецФункции
